WaitFme/CH32V307-ST773s-Demo/Drivers/st7735.h
#ifndef __ST7735_H
#define __ST7735_H

#include "ch32v30x.h"

#define USE_HORIZONTAL 1

#if USE_HORIZONTAL == 0 || USE_HORIZONTAL == 1
	#define LCD_W 128
	#define LCD_H 160
#else
	#define LCD_W 160
	#define LCD_H 128
#endif

#define WHITE				0xFFFF
#define BLACK				0x0000
#define BLUE				0x001F
#define BRED				0XF81F
#define GRED				0XFFE0
#define GBLUE				0X07FF
#define RED					0xF800
#define MAGENTA				0xF81F
#define GREEN				0x07E0
#define CYAN				0x7FFF
#define YELLOW				0xFFE0
#define BROWN				0XBC40
#define BRRED				0XFC07
#define GRAY				0X8430
#define DARKBLUE			0X01CF
#define LIGHTBLUE			0X7D7C
#define GRAYBLUE			0X5458
#define LIGHTGREEN 			0X841F
#define LGRAY				0XC618
#define LGRAYBLUE			0XA651
#define LBBLUE				0X2B12

#define LCD_Port			GPIOB
#define LCD_DC_Pin			GPIO_Pin_0
#define LCD_CS_Pin			GPIO_Pin_1
#define LCD_RST_Pin			GPIO_Pin_12

#define LCD_DC_WB(x)		GPIO_WriteBit(LCD_Port, LCD_DC_Pin, (BitAction)(x))
#define LCD_CS_WB(x)		GPIO_WriteBit(LCD_Port, LCD_CS_Pin, (BitAction)(x))
#define LCD_RST_WB(x)		GPIO_WriteBit(LCD_Port, LCD_RST_Pin, (BitAction)(x))

void LCD_Init(void);
void LCD_WriteData(uint8_t data);
void LCD_WriteData_16Bit(uint16_t data);
void LCD_WriteCMD(uint8_t cmd);
void LCD_Address_Set(uint16_t x1,uint16_t y1,uint16_t x2,uint16_t y2);
void LCD_Fill(uint16_t xsta,uint16_t ysta,uint16_t xend,uint16_t yend,uint16_t color);
void LCD_Fill_DMA(uint16_t xsta, uint16_t ysta, uint16_t xend, uint16_t yend, uint16_t color);
void LCD_Clear(uint16_t color);
void LCD_DrawPoint(uint16_t x,uint16_t y,uint16_t color);
void LCD_DrawLine(uint16_t x1,uint16_t y1,uint16_t x2,uint16_t y2,uint16_t color);
void LCD_DrawRectangle(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2,uint16_t color);
void LCD_DrawCircle(uint16_t x0, uint16_t y0, uint8_t r, uint16_t color);
void LCD_ShowChar(uint16_t x, uint16_t y, uint8_t num, uint16_t fc, uint16_t bc, uint8_t sizey, uint8_t mode);
void LCD_ShowString(uint16_t x, uint16_t y, const uint8_t *data, uint16_t fc, uint16_t bc, uint8_t sizey, uint8_t mode);
uint32_t mypow(uint8_t m, uint8_t n);
void LCD_ShowIntNum(uint16_t x, uint16_t y, uint16_t num, uint8_t len, uint16_t fc, uint16_t bc, uint8_t sizey);
void LCD_ShowFloatNum(uint16_t x, uint16_t y, float num, uint8_t len, uint16_t fc, uint16_t bc, uint8_t sizey);

#endif
